[
  {
    "id": "blaidd",
    "name": "Blaidd the Half-Wolf",
    "race": "Shadowbound Beast",
    "role": "Ally",
    "locations": ["Mistwood Ruins", "Siofra River", "Redmane Castle", "Three Sisters"],
    "region": "Limgrave",
    "affiliation": "Ranni the Witch",
    "quest": "Ranni's Questline",
    "is_hostile": false,
    "becomes_hostile": true,
    "drops": ["Royal Greatsword", "Blaidd's Set"],
    "description": "A half-wolf warrior serving as the faithful shadow to Lunar Princess Ranni. He was created by Ranni's Two Fingers as an unswervingly loyal vassal, designed incapable of betrayal.",
    "lore": "Blaidd was created by Ranni's Two Fingers as an unswervingly loyal vassal. However, a hidden failsafe was embedded in him: should Ranni reject her predetermined destiny and rebel against the Greater Will, Blaidd would gradually descend into madness, eventually becoming a threat to her. He was approved by Rennala and raised as Ranni's stepbrother. The name Blaidd is Welsh for wolf.",
    "dialogue": "Let's give them a show to remember, eh. Just don't you go dying on me. For Ranni's sake too."
  },
  {
    "id": "ranni",
    "name": "Ranni the Witch",
    "race": "Demigod",
    "role": "Quest Giver",
    "locations": ["Ranni's Rise", "Church of Elleh", "Moonlight Altar"],
    "region": "Liurnia",
    "affiliation": "Carian Royal Family",
    "quest": "Ranni's Questline",
    "is_hostile": false,
    "becomes_hostile": false,
    "drops": ["Dark Moon Greatsword"],
    "description": "Lunar Princess Ranni is one of the Demigods and the focus of an elaborate questline leading to the Age of the Stars ending. She inhabits a four-armed doll body after discarding her original flesh.",
    "lore": "Born to Radagon and Queen Rennala, Ranni was an Empyrean chosen as a potential successor to Queen Marika. Rejecting her predetermined role as puppet to the Greater Will, she stole a Rune of Death fragment and orchestrated the Night of Black Knives. She killed her own body while assassins murdered Godwyn the Golden, freeing herself from her Empyrean fate.",
    "dialogue": "I am the witch Ranni. I stole Death long ago, and search now for the dark path. That I might one day upend the whole of it, and rid the world of all that came before."
  },
  {
    "id": "melina",
    "name": "Melina",
    "race": "Demigod",
    "role": "Finger Maiden",
    "locations": ["Church of Elleh", "Roundtable Hold", "Leyndell", "Forge of the Giants"],
    "region": "Limgrave",
    "affiliation": "Erdtree",
    "quest": "Main Story",
    "is_hostile": false,
    "becomes_hostile": false,
    "drops": [],
    "description": "A mysterious spectral maiden who offers the Tarnished an accord: she will turn runes into strength in exchange for passage to the Erdtree. She was born at the foot of the Erdtree where her mother gave her a purpose she has since forgotten.",
    "lore": "Melina was born at the foot of the Erdtree, where her mother Queen Marika the Eternal gave her a purpose. Her body was burned at some point, leaving her as a bodiless spirit with no memory of her original purpose. Evidence suggests she is another demigod child of Radagon and Marika. She ultimately sacrifices herself at the Forge of the Giants to burn the Erdtree.",
    "dialogue": "I can play the role of maiden. Turning runes into strength. To aid you in your search for the Elden Ring. You need only take me with you, to the foot of the Erdtree."
  },
  {
    "id": "patches",
    "name": "Patches",
    "race": "Tarnished",
    "role": "Merchant",
    "locations": ["Murkwater Cave", "Scenic Isle", "Mt. Gelmir", "Volcano Manor"],
    "region": "Limgrave",
    "affiliation": "Volcano Manor",
    "quest": "Volcano Manor Questline",
    "is_hostile": true,
    "becomes_hostile": false,
    "drops": ["Spear", "Leather Armor"],
    "description": "A cunning trickster and merchant known as The Untethered. He leads a group of bandits and has a habit of deceiving and robbing travelers, though he becomes a legitimate merchant after being defeated.",
    "lore": "Patches is a Tarnished who leads a group of bandits comprised of retired soldiers from a defeated army. Despite his roguish behavior tricking and robbing travelers, he shows loyalty to those he respects. He eventually joins Volcano Manor as a Recusant and later seeks legitimacy through honest commerce.",
    "dialogue": "Well, well, well? Thought you'd just help yourself to a man's personal belongings? You're a thief, a common thief. And you know what happens to thieves around here?"
  },
  {
    "id": "kale",
    "name": "Merchant Kale",
    "race": "Human",
    "role": "Merchant",
    "locations": ["Church of Elleh"],
    "region": "Limgrave",
    "affiliation": "Nomadic Merchants",
    "quest": "None",
    "is_hostile": false,
    "becomes_hostile": false,
    "drops": ["Kale's Bell Bearing"],
    "description": "A nomadic trader who operates from the Church of Elleh in Limgrave. He is the sole vendor of the Crafting Kit and one of the first merchant encounters for most players.",
    "lore": "Kale belongs to a wandering people historically spurned by divine grace. His ancestors, the Great Caravan, were entombed beneath Leyndell. Despite their outcaste status, the nomadic merchants have adapted well to the Shattering. He knows Blaidd personally, describing him as boorish and blunt but a good egg.",
    "dialogue": "A crafting kit allows you to make basic items on your own. Essential really, if you intend to survive out here."
  },
  {
    "id": "alexander",
    "name": "Alexander, Warrior Jar",
    "race": "Living Jar",
    "role": "Ally",
    "locations": ["Stormhill", "Liurnia", "Mt. Gelmir", "Crumbling Farum Azula"],
    "region": "Limgrave",
    "affiliation": "None",
    "quest": "Alexander's Questline",
    "is_hostile": false,
    "becomes_hostile": true,
    "drops": ["Alexander's Innards", "Shard of Alexander"],
    "description": "A living jar warrior on a journey to become stronger. He is an honorable and friendly companion who dreams of becoming the mightiest warrior jar. He asks for an honorable duel to the death at the end of his quest.",
    "lore": "Alexander is a Living Jar filled with the remains of fallen warriors, which grants him strength. He travels the Lands Between seeking worthy battles to fill himself with strong warriors. His journey takes him from being stuck in the ground at Stormhill to fighting alongside the player against Starscourge Radahn.",
    "dialogue": "I am Alexander, also known as the Iron Fist. I'm a warrior jar, and I'm on a journey. To hone myself to become the mightiest warrior jar there ever was!"
  },
  {
    "id": "fia",
    "name": "Fia, Deathbed Companion",
    "race": "Human",
    "role": "Quest Giver",
    "locations": ["Roundtable Hold", "Deeproot Depths"],
    "region": "Roundtable Hold",
    "affiliation": "Those Who Live in Death",
    "quest": "Fia's Questline",
    "is_hostile": false,
    "becomes_hostile": false,
    "drops": ["Fia's Set", "Radiant Baldachin's Blessing"],
    "description": "A Deathbed Companion who offers to hold the Tarnished in her arms at Roundtable Hold. She seeks to restore the natural cycle of life and death by creating a new god from the remains of Godwyn.",
    "lore": "Fia was a Deathbed Companion who would lie with champions before their final battle, absorbing their vitality to pass to the next. She believes the Golden Order's denial of death is wrong and seeks to restore Those Who Live in Death to their rightful place. She plans to birth a new god using Godwyn's cursed remains.",
    "dialogue": "Would you allow me to hold you, but briefly? Perhaps you might share with me some of your lifely vigour."
  },
  {
    "id": "gideon",
    "name": "Sir Gideon Ofnir, the All-Knowing",
    "race": "Tarnished",
    "role": "Information Broker",
    "locations": ["Roundtable Hold", "Leyndell"],
    "region": "Roundtable Hold",
    "affiliation": "Roundtable Hold",
    "quest": "Main Story",
    "is_hostile": false,
    "becomes_hostile": true,
    "drops": ["All-Knowing Set", "Scepter of the All-Knowing"],
    "description": "The leader of the Roundtable Hold who has dedicated himself to gathering knowledge about the demigods and shardbearers. He provides information and guidance but ultimately becomes a boss encounter.",
    "lore": "Gideon Ofnir is a Tarnished who became obsessed with knowledge, earning the title All-Knowing. He leads the Roundtable Hold but secretly believes no Tarnished can become Elden Lord. He fights the player in Leyndell using spells learned from studying the demigods, including Malenia's scarlet rot and Mohg's blood magic.",
    "dialogue": "A Tarnished cannot become a Lord. Not even you. A man cannot kill a god."
  }
]
